MissouriMRDT/RoveBoard/Roveboard/msp432p401r_API/RovePwmWrite/RovePwmWrite_MSP432P401R.cpp
static TimerAPwmConfig* getPwmModule(uint16_t moduleIndex)
{
  TimerAPwmConfig* module = 0;
  switch(moduleIndex)
  {
    case 0:
      module = &pwm0Config;
      break;

    case 1:
      module = &pwm1Config;
      break;

    case 2:
      module = &pwm2Config;
      break;

    case 3:
      module = &pwm3Config;
      break;
  }

  return module;
}

bool validateInput(uint8_t writeModule, uint8_t pin)
{
  switch(writeModule)
  {
    case 0:
      if(pin == P2_4 || pin == P2_5 || pin == P2_6 || pin == P2_7)
      {
        return true;
      }
      break;

    case 1:
      if(pin == P7_7 || pin == P7_6 || pin == P7_5 || pin == P7_4)
      {
        return true;
      }
      break;

    case 2:
      if(pin == P5_6 || pin == P5_7 || pin == P6_6 || pin == P6_7)
      {
        return true;
      }
      break;

    case 3:
      if(pin == P10_5 || pin == P8_2 || pin == P9_2 || pin == P9_3)
      {
        return true;
      }
      break;
  }

  return false;
}

rovePwmWrite_Handle setupPwmWrite(uint8_t writeModule, uint8_t pin)
{
  rovePwmWrite_Handle handle;
  TimerAPwmConfig* moduleData = getPwmModule(writeModule);

  if(pin > 100)
  {
    debugFault("setupPwmWrite: pin value is nonsense");
  }
  else if (writeModule > 3)
  {
    debugFault("setupPwmWrite: writeModule value is nonsense");
  }
  else if(validateInput(writeModule, pin) == false)
  {
    debugFault("setupPwmWrite: module doesn't fit pin");
  }

  MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(pinToPinPort[pin], pinToPinMask[pin], GPIO_PRIMARY_MODULE_FUNCTION);

  handle.initialized = true;
  handle.index = writeModule;
  handle.pin = pin;
  handle.alignment = LeftAligned;
  handle.inverted = false;
  handle.duty = 0;

  setPwmTotalPeriod(handle, DefaultPeriodUs);
  return handle;
}

void pwmWriteDuty(rovePwmWrite_Handle handle, uint8_t duty)
{
  float percentDuty;
  TimerAPwmConfig* moduleData;
  Timer_A_PWMConfig config;

  if(handle.initialized == false)
  {
    debugFault("pwmWriteDuty: handle not initialized");
  }
  else if(duty == 0)
  {
    GPIO_setAsOutputPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    GPIO_setOutputLowOnPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    handle.duty = 0;
  }
  else if(duty == 255)
  {
    GPIO_setAsOutputPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    GPIO_setOutputHighOnPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    handle.duty = 255;
  }
  else
  {
    moduleData = getPwmModule(handle.index);
    handle.duty = duty;
    percentDuty = (float)duty/255.0; //0-255 is input for duty, being 8 bit

    config.clockSource = moduleData->clockSource;
    config.clockSourceDivider = moduleData->clockSourceDivider;
    config.timerPeriod = moduleData->timerPeriod;
    config.compareOutputMode = alignmentToOutputMode[handle.alignment];
    config.compareRegister = pinToCCRegister[handle.pin];
    config.dutyCycle =  ((float)moduleData->timerPeriod) * percentDuty;

    Timer_A_generatePWM(pinToTimerA[handle.pin], &config);
  }
}

void pwmWriteWidth(rovePwmWrite_Handle handle, uint32_t pulseW_us)
{
  TimerAPwmConfig* moduleData = getPwmModule(handle.index);
  Timer_A_PWMConfig config;

  if(handle.initialized == false)
  {
    debugFault("pwmWriteDuty: handle not initialized");
  }
  else if(pulseW_us == 0)
  {
    GPIO_setAsOutputPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    GPIO_setOutputLowOnPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    handle.duty = 0;
  }
  else if(pulseW_us >= moduleData->getTimerPeriodUs())
  {
    GPIO_setAsOutputPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    GPIO_setOutputHighOnPin(pinToPinPort[handle.pin], pinToPinMask[handle.pin]);
    handle.duty = 255;
  }
  else
  {
    handle.duty = (pulseW_us * 100) / moduleData->getTimerPeriodUs();
    handle.duty = map(handle.duty, 0, 100, 0, 255);

    config.clockSource = moduleData->clockSource;
    config.clockSourceDivider = moduleData->clockSourceDivider;
    config.timerPeriod = moduleData->timerPeriod;
    config.compareOutputMode = alignmentToOutputMode[handle.alignment];
    config.compareRegister = pinToCCRegister[handle.pin];
    config.dutyCycle = moduleData->pulseWidthUsToTimerTicks(pulseW_us);

    Timer_A_generatePWM(pinToTimerA[handle.pin], &config);
  }
}

void setPwmTotalPeriod(rovePwmWrite_Handle handle, uint32_t pulsePeriod_us)
{
  uint32_t clockSource;
  uint8_t clockDivisor;
  TimerAPwmConfig * moduleData;

  if(handle.initialized == false)
  {
    debugFault("setPwmPeriod: handle not initialized");
  }

  moduleData = getPwmModule(handle.index);
  if(getOptimalClockSettings(pulsePeriod_us, moduleData, &clockSource, &clockDivisor) == 0)
  {
    return;
  }

  moduleData->clockSource = clockSource;
  moduleData->clockSourceDivider = clockDivisor;
  moduleData->timerPeriod = moduleData->timerPeriodUsToTimerPeriodTicks(pulsePeriod_us);

  //if we're currently writing out a pwm waveform, re-set it up and continue writing
  if(0 < handle.duty && handle.duty < 255)
  {
    pwmWriteDuty(handle, handle.duty);
  }
}

void setPwmAlignment(rovePwmWrite_Handle handle, pwmAlignment alignment)
{
  if(handle.initialized == false)
  {
   debugFault("setPwmAlignment: handle not initialized");
  }

  handle.alignment = alignment;

  //if we're currently writing out a pwm waveform, re-set it up and continue writing
  if(0 < handle.duty && handle.duty < 255)
  {
    pwmWriteDuty(handle, handle.duty);
  }
}

//configures the pwm clock source for operation by selecting the most accurate clock that can service the desired maximum pulse period.
//returns true if settings were found, false if no setting worked
static bool getOptimalClockSettings(uint32_t pulsePeriod_us, TimerAPwmConfig *currentConfig, uint32_t *clockSource, uint8_t *clockDivisor)
{
  uint8_t divisorFound;
  uint32_t sourceFound;
  uint32_t loadWithCurrentSettings = getTimerPeriodTicks(pulsePeriod_us, currentConfig->getClockSourceFreq(), currentConfig->clockSourceDivider);

  //in general, the system is more accurate the faster the clocks can go. But the faster they go, the smaller their maximum period is.
  //If the current clock source and divisor is too fast, we have to try to slow it down until we fit the max
  if(loadWithCurrentSettings > PeriodMaxLoad)
  {
    //search fastest first. Then if that clock source didn't work, try the other one
    if(CS_getACLK() > CS_getSMCLK())
    {
      sourceFound = TIMER_A_CLOCKSOURCE_ACLK;
      divisorFound = getOptimalDivisorGoingSlower(pulsePeriod_us, CS_getACLK());

      if(divisorFound == 0)
      {
        sourceFound = TIMER_A_CLOCKSOURCE_SMCLK;
        divisorFound = getOptimalDivisorGoingSlower(pulsePeriod_us, CS_getSMCLK());

        if(divisorFound == 0)
        {
          return false;
        }
      }
    }
  }

  //current settings can work, but let's choose the most accurate of the bunch
  else if(loadWithCurrentSettings < PeriodMaxLoad)
  {
    //search fastest first. Then if that clock source didn't work, try the other one
    if(CS_getACLK() > CS_getSMCLK())
    {
     sourceFound = TIMER_A_CLOCKSOURCE_ACLK;
     divisorFound = getOptimalDivisorGoingFaster(pulsePeriod_us, CS_getACLK());

     if(divisorFound == 0)
     {
       sourceFound = TIMER_A_CLOCKSOURCE_SMCLK;
       divisorFound = getOptimalDivisorGoingFaster(pulsePeriod_us, CS_getSMCLK());

       if(divisorFound == 0)
       {
         return false;
       }
     }
    }
  }

  //what do you know, this is already the best we can get
  else
  {
    divisorFound = *clockDivisor;
    sourceFound = *clockSource;
  }

  *clockDivisor = divisorFound;
  *clockSource = sourceFound;

