MissouriMRDT/RoveBoard/Roveboard/msp432p401r_API/RovePwmWrite/RovePwmWrite_MSP432P401R.cpp
  return true;
}

static uint32_t getTimerPeriodTicks(const uint32_t pulsePeriod_us, const uint32_t clockFreq, const uint8_t clockDivisor)
{
  return (pulsePeriod_us * 1000000) / (clockFreq / clockDivisor);
}

static uint32_t getOptimalDivisorGoingSlower(const uint32_t pulsePeriod_us, const uint32_t clockFreq)
{
  return getOptimalDivisorGoingSlower(pulsePeriod_us, clockFreq, 1); //start with the fastest divisor, 1, and go slower from there
}

static uint32_t getOptimalDivisorGoingSlower(const uint32_t pulsePeriod_us, const uint32_t clockFreq, uint8_t clockDivisor)
{
  uint32_t thisPeriod = getTimerPeriodTicks(pulsePeriod_us, clockFreq, clockDivisor);
  if(thisPeriod <= PeriodMaxLoad)
  {
    return clockDivisor;
  }
  else
  {
    //valid values are weird, not simply multiplied by two every time
    if(clockDivisor < 8)
    {
      clockDivisor += 1;
    }
    else if(clockDivisor < 16)
    {
      clockDivisor += 2;
    }
    else if(clockDivisor < 32)
    {
      clockDivisor += 4;
    }
    else if(clockDivisor < 64)
    {
      clockDivisor += 8;
    }
    else
    {
      return 0; //no divider worked for this clock
    }

    return getOptimalDivisorGoingSlower(pulsePeriod_us, clockFreq, clockDivisor);
  }
}

static uint32_t getOptimalDivisorGoingFaster(const uint32_t pulsePeriod_us, const uint32_t clockFreq)
{
  return getOptimalDivisorGoingFaster(pulsePeriod_us, clockFreq, 64); //start with the slowest divisor of 64 and work up
}

static uint32_t getOptimalDivisorGoingFaster(const uint32_t pulsePeriod_us, const uint32_t clockFreq, const uint8_t clockDivisor)
{
  const int UseLastCalculation = 255;
  uint8_t newDivisor = clockDivisor;
  uint8_t retVal;
  uint32_t thisPeriod = getTimerPeriodTicks(pulsePeriod_us, clockFreq, clockDivisor);

  //if we're already at 64 and above the max period, then this clock in general is too fast
  if(thisPeriod > PeriodMaxLoad && clockDivisor >= 64)
  {
    return 0;
  }

  //if we just now went above the max, then it means the last calculated divisor was the closest we could get
  else if(thisPeriod > PeriodMaxLoad)
  {
    return UseLastCalculation;
  }

  //this period is under the max. Keep going till we cross the max
  else
  {
    //valid values are weird, not simply multiplied by two every time
    if(clockDivisor == 1)
    {
      return 1; //best we can get on this clock, we never hit our limit
    }
    else if(clockDivisor <= 8)
    {
      newDivisor = clockDivisor - 1;
    }
    else if(clockDivisor <= 16)
    {
      newDivisor = clockDivisor - 2;
    }
    else if(clockDivisor <= 32)
    {
      newDivisor = clockDivisor - 4;
    }
    else if(clockDivisor <= 64)
    {
      newDivisor = clockDivisor - 8;
    }

    retVal =  getOptimalDivisorGoingFaster(pulsePeriod_us, clockFreq, newDivisor);

    //if the next loop says that it hit the max, then it means the clock divisor in this loop
    //is the best available
    if(retVal == UseLastCalculation)
    {
      return clockDivisor;
    }
    else
    {
      return retVal;
    }
  }
}
